MarijnVerschuren/STM32F411/inc/memory_map.h
//
// Created by marijn on 9/9/24.
//

#ifndef STM32F411_MEMORY_MAP_H
#define STM32F411_MEMORY_MAP_H


/*!<
 * core hardware memory map
 * */
#define SCS_BASE					(0xE000E000UL)
#define ITM_BASE					(0xE0000000UL)
#define DWT_BASE					(0xE0001000UL)
#define TPI_BASE					(0xE0040000UL)
#define CORE_DEBUG_BASE				(0xE000EDF0UL)
/*!< core hardware peripherals */
#define SYS_TICK_BASE				(SCS_BASE +  0x0010UL)
#define NVIC_BASE					(SCS_BASE +  0x0100UL)
#define SCB_BASE					(SCS_BASE +  0x0D00UL)



/*!<
 * hardware memory map
 * */
#define FLASH_BASE					0x08000000UL
#define SRAM_BASE					0x20000000UL
#define PERIPH_BASE					0x40000000UL

#define SRAM_BB_BASE				0x22000000UL
#define PERIPH_BB_BASE				0x42000000UL
#define BKUP_SRAM_BB_BASE			0x42480000UL

#define FLASH_END					0x0807FFFFUL
#define FLASH_OTP_BASE				0x1FFF7800UL
#define FLASH_OTP_END				0x1FFF7A0FUL



/*!<
 * extended hardware memory map
 * */
#define APB1PERIPH_BASE				PERIPH_BASE
#define APB2PERIPH_BASE				(PERIPH_BASE + 0x00010000UL)
#define AHB1PERIPH_BASE				(PERIPH_BASE + 0x00020000UL)
#define AHB2PERIPH_BASE				(PERIPH_BASE + 0x10000000UL)



/*!<
 * APB1 peripheral map
 * */
#define TIM2_BASE					(APB1PERIPH_BASE + 0x0000UL)
#define TIM3_BASE					(APB1PERIPH_BASE + 0x0400UL)
#define TIM4_BASE					(APB1PERIPH_BASE + 0x0800UL)
#define TIM5_BASE					(APB1PERIPH_BASE + 0x0C00UL)
#define RTC_BASE					(APB1PERIPH_BASE + 0x2800UL)
#define WWDG_BASE					(APB1PERIPH_BASE + 0x2C00UL)
#define IWDG_BASE					(APB1PERIPH_BASE + 0x3000UL)
#define I2S2_EXT_BASE				(APB1PERIPH_BASE + 0x3400UL)
#define SPI2_BASE					(APB1PERIPH_BASE + 0x3800UL)
#define SPI3_BASE					(APB1PERIPH_BASE + 0x3C00UL)
#define I2S3_EXT_BASE				(APB1PERIPH_BASE + 0x4000UL)
#define USART2_BASE					(APB1PERIPH_BASE + 0x4400UL)
#define I2C1_BASE					(APB1PERIPH_BASE + 0x5400UL)
#define I2C2_BASE					(APB1PERIPH_BASE + 0x5800UL)
#define I2C3_BASE					(APB1PERIPH_BASE + 0x5C00UL)
#define PWR_BASE					(APB1PERIPH_BASE + 0x7000UL)



/*!<
 * APB2 peripheral map
 * */
#define TIM1_BASE					(APB2PERIPH_BASE + 0x0000UL)
#define USART1_BASE					(APB2PERIPH_BASE + 0x1000UL)
#define USART6_BASE					(APB2PERIPH_BASE + 0x1400UL)
#define ADC1_BASE					(APB2PERIPH_BASE + 0x2000UL)
#define ADC_COMMON_BASE				(APB2PERIPH_BASE + 0x2300UL)
#define SDIO_BASE					(APB2PERIPH_BASE + 0x2C00UL)
#define SPI1_BASE					(APB2PERIPH_BASE + 0x3000UL)
#define SPI4_BASE					(APB2PERIPH_BASE + 0x3400UL)
#define SYSCFG_BASE					(APB2PERIPH_BASE + 0x3800UL)
#define EXTI_BASE					(APB2PERIPH_BASE + 0x3C00UL)
#define TIM9_BASE					(APB2PERIPH_BASE + 0x4000UL)
#define TIM10_BASE					(APB2PERIPH_BASE + 0x4400UL)
#define TIM11_BASE					(APB2PERIPH_BASE + 0x4800UL)
#define SPI5_BASE					(APB2PERIPH_BASE + 0x5000UL)


/*!<
 * AHB1 peripheral map
 * */
#define GPIOA_BASE					(AHB1PERIPH_BASE + 0x0000UL)
#define GPIOB_BASE					(AHB1PERIPH_BASE + 0x0400UL)
#define GPIOC_BASE					(AHB1PERIPH_BASE + 0x0800UL)
#define GPIOD_BASE					(AHB1PERIPH_BASE + 0x0C00UL)
#define GPIOE_BASE					(AHB1PERIPH_BASE + 0x1000UL)
#define GPIOH_BASE					(AHB1PERIPH_BASE + 0x1C00UL)
#define CRC_BASE					(AHB1PERIPH_BASE + 0x3000UL)
#define RCC_BASE					(AHB1PERIPH_BASE + 0x3800UL)
#define FLASH_CTRL_BASE				(AHB1PERIPH_BASE + 0x3C00UL)
#define DMA1_BASE					(AHB1PERIPH_BASE + 0x6000UL)
#define DMA1_STR0_BASE				(DMA1_BASE + 0x010UL)
#define DMA1_STR1_BASE				(DMA1_BASE + 0x028UL)
#define DMA1_STR2_BASE				(DMA1_BASE + 0x040UL)
#define DMA1_STR3_BASE				(DMA1_BASE + 0x058UL)
#define DMA1_STR4_BASE				(DMA1_BASE + 0x070UL)
#define DMA1_STR5_BASE				(DMA1_BASE + 0x088UL)
#define DMA1_STR6_BASE				(DMA1_BASE + 0x0A0UL)
#define DMA1_STR7_BASE				(DMA1_BASE + 0x0B8UL)
#define DMA2_BASE					(AHB1PERIPH_BASE + 0x6400UL)
#define DMA2_STR0_BASE				(DMA2_BASE + 0x010UL)
#define DMA2_STR1_BASE				(DMA2_BASE + 0x028UL)
#define DMA2_STR2_BASE				(DMA2_BASE + 0x040UL)
#define DMA2_STR3_BASE				(DMA2_BASE + 0x058UL)
#define DMA2_STR4_BASE				(DMA2_BASE + 0x070UL)
#define DMA2_STR5_BASE				(DMA2_BASE + 0x088UL)
#define DMA2_STR6_BASE				(DMA2_BASE + 0x0A0UL)
#define DMA2_STR7_BASE				(DMA2_BASE + 0x0B8UL)



/*!<
 * AHB2 peripheral map
 * */
#define USB_BASE					AHB2PERIPH_BASE
#define USB_HOST_REL_BASE			0x0400UL
#define USB_HOST_PORT_REL_BASE		0x0040UL
#define USB_HOST_CH_REL_BASE		0x0100UL
#define USB_DEV_REL_BASE			0x0800UL
#define USB_IEP_REL_BASE			0x0900UL
#define USB_OEP_REL_BASE			0x0B00UL
#define USB_PCGCCTL_REL_BASE		0x0E00UL
#define USB_FIFO_REL_BASE			0x1000UL

#define USB_HOST_CHANNEL_SIZE		0x20UL
#define USB_EP_SIZE					0x20UL
#define USB_FIFO_SIZE				0x1000UL



/*!<
 * misc peripheral map
 * */
#define UID_BASE					0x1FFF7A10UL
#define FLASHSIZE_BASE				0x1FFF7A22UL
#define PACKAGE_BASE				0x1FFF7BF0UL
#define DBGMCU_BASE					0xE0042000UL



/*!<
 * core peripheral register maps
 * */
/*!< SCS */
#define SCS_ICTR		0x4U
#define SCS_ACTLR		0x8U

/*!< SYS TICK */
#define SYS_TICK_CTRL	0x0U
#define SYS_TICK_LOAD	0x4U
#define SYS_TICK_VAL	0x8U
#define SYS_TICK_CALIB	0xCU

/*!< NVIC */
#define NVIC_ISER		0x000
#define NVIC_ICER		0x080
#define NVIC_ISPR		0x100
#define NVIC_ICPR		0x180
#define NVIC_IABR		0x200
#define NVIC_IP			0x300
#define NVIC_STIR		0xE00

/*!< SCB */
#define SCB_CPUID		0x00U
#define SCB_ICSR		0x04U
#define SCB_VTOR		0x08U
#define SCB_AIRCR		0x0CU
#define SCB_SCR			0x10U
#define SCB_CCR			0x14U
#define SCB_SHP			0x18U
#define SCB_SHCSR		0x24U
#define SCB_CFSR		0x28U
#define SCB_HFSR		0x2CU
#define SCB_DFSR		0x30U
#define SCB_MMFAR		0x34U
#define SCB_BFAR		0x38U
#define SCB_AFSR		0x3CU
#define SCB_PFR			0x40U
#define SCB_DFR			0x48U
#define SCB_ADR			0x4CU
#define SCB_MMFR		0x50U
#define SCB_ISAR		0x60U
#define SCB_CPACR		0x88U


/*!<
 * peripheral register maps
 * */
/*!< WWDG TODO */

/*!< IWDG TODO */

/*!< PWR */
#define PWR_CR			0x00U
#define PWR_CSR			0x04U

/*!< FLASH_CTRL */
#define FLASH_CTRL_ACR		0x00U
#define FLASH_CTRL_KEYR		0x04U
#define FLASH_CTRL_OPTKEYR	0x08U
#define FLASH_CTRL_SR		0x0CU
#define FLASH_CTRL_CR		0x10U
#define FLASH_CTRL_OPTCR	0x14U
#define FLASH_CTRL_OPTCR1	0x18U

/*!< RCC */
#define RCC_CR			0x00U
#define RCC_PLLCFGR		0x04U
#define RCC_CFGR		0x08U
#define RCC_CIR			0x0CU
#define RCC_AHB1RSTR	0x10U
#define RCC_AHB2RSTR	0x14U
#define RCC_AHB3RSTR	0x18U
#define RCC_APB1RSTR	0x20U
#define RCC_APB2RSTR	0x24U
#define RCC_AHB1ENR		0x30U
#define RCC_AHB2ENR		0x34U
#define RCC_AHB3ENR		0x38U
#define RCC_APB1ENR		0x40U
#define RCC_APB2ENR		0x44U
#define RCC_AHB1LPENR	0x50U
#define RCC_AHB2LPENR	0x54U
#define RCC_APB1LPENR	0x60U
#define RCC_APB2LPENR	0x64U
#define RCC_BDCR		0x70U
#define RCC_CSR			0x74U
#define RCC_SSCGR		0x80U
#define RCC_PLLI2SCFGR	0x84U
#define RCC_DCKCFGR		0x8CU
#define RCC_CKGATENR	0x90U
#define RCC_DCKCFGR1	0x94U

